In [1]:
# (1) Create a .CSV file (or optionally, a MySQL database!) that includes all of the information below. 
# You may change
# the structure of the information as you like.
# (2) Read the information from your .CSV file into pandas, 
# and perform analysis to compare the arrival delays for the
# two airlines.
# (3) Your code should be in a Jupyter (IPython) notebook (in GitHub), 
# and should include narrative descriptions of your
# analysis and conclusions.

# Saar Turjeman
# IS362 - CUNY SPS SPRING 2024

In [2]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [3]:
df = pd.read_csv("assignment#1.csv")
df

,Unnamed: 0,Unnamed: 1,Los Angeles,Phoenix,San Diego,San Francisco,Seattle
0,ALASKA,on time,497,221,212,503,1841
1,ALASKA,delyaed,62,12,20,102,305
2,AM WEST,on time,694,4840,383,320,201
3,AM WEST,delyaed,117,415,65,129,61

In [4]:
# approach to solving the problem

# 1. Rename columns.
# 2. Show airline data separately.
# 3. show airline vs airline by destiation and on time performance.
# 4. show cumaltive data for all stations.
# 5. take the descrpitive data and explain each for each airline

In [5]:
df.columns = ['Airline', 'Flight Status', 'Los Angeles', 'Phoenix', 'San Diego', 'San Francisco', 'Seattle']

In [6]:
df

,Airline,Flight Status,Los Angeles,Phoenix,San Diego,San Francisco,Seattle
0,ALASKA,on time,497,221,212,503,1841
1,ALASKA,delyaed,62,12,20,102,305
2,AM WEST,on time,694,4840,383,320,201
3,AM WEST,delyaed,117,415,65,129,61

In [7]:
# extract the ALASKA airline data separately
df.loc[0:1]

,Airline,Flight Status,Los Angeles,Phoenix,San Diego,San Francisco,Seattle
0,ALASKA,on time,497,221,212,503,1841
1,ALASKA,delyaed,62,12,20,102,305

In [8]:
# extract the AM WEST airline data separately
df.loc[2:3]

,Airline,Flight Status,Los Angeles,Phoenix,San Diego,San Francisco,Seattle
2,AM WEST,on time,694,4840,383,320,201
3,AM WEST,delyaed,117,415,65,129,61

In [47]:
# ALASKA ON TIME
df.loc[0]

Airline           ALASKA
Flight Status    on time
Los Angeles          497
Phoenix              221
San Diego            212
San Francisco        503
Seattle             1841
Name: 0, dtype: object

In [48]:
# alaska cities on time
alaska_cities = df.iloc[0,2:]
alaska_cities

# change type from object to int to performe math calculations 

alaska_cities.astype(np.int64)

Los Angeles       497
Phoenix           221
San Diego         212
San Francisco     503
Seattle          1841
Name: 0, dtype: int64

In [49]:
# run the describe method, shows math operations: count, mean, std, min, 25%, 50%, 75%, mac
alaska_cities.astype(np.int64).describe()

count       5.000000
mean      654.800000
std       678.098223
min       212.000000
25%       221.000000
50%       497.000000
75%       503.000000
max      1841.000000
Name: 0, dtype: float64

In [57]:
# average ALASKA on time flight performance
alaska_cities_ontime_mean = alaska_cities.mean()
alaska_cities_ontime_mean

654.8

In [51]:
# AM WEST ON TIME
df.loc[2]

Airline          AM WEST
Flight Status    on time
Los Angeles          694
Phoenix             4840
San Diego            383
San Francisco        320
Seattle              201
Name: 2, dtype: object

In [53]:
# AM WEST cities on time
amwest_cities = df.iloc[2,2:]
amwest_cities

# change type from object to int to performe math calculations 

amwest_cities.astype(np.int64)

Los Angeles       694
Phoenix          4840
San Diego         383
San Francisco     320
Seattle           201
Name: 2, dtype: int64

In [54]:
# run the describe method, shows math operations: count, mean, std, min, 25%, 50%, 75%, max
amwest_cities.astype(np.int64).describe()

count       5.000000
mean     1287.600000
std      1994.188883
min       201.000000
25%       320.000000
50%       383.000000
75%       694.000000
max      4840.000000
Name: 2, dtype: float64

In [56]:
# average AM WEST on time flight performance
amwest_ontime_mean = amwest_cities.mean()
amwest_ontime_mean

1287.6

In [75]:
# compare the ontime flights for both airlines and put in a new dataframe
df1 = pd.DataFrame({
    'ALASKA average on time flights': [alaska_cities_ontime_mean],
    'AM WEST average on time flights': [amwest_ontime_mean]
})
df1

   ALASKA average on time flights  AM WEST average on time flights
0                           654.8                           1287.6

In [70]:
# ALASKA delayed flights
df.loc[1]
# alaska cities delayed flights 
alaska_cities_d = df.iloc[1,2:]
alaska_cities_d

# change type from object to int to performe math calculations 

alaska_cities_d.astype(np.int64)

# run the describe method, shows math operations: count, mean, std, min, 25%, 50%, 75%, max
alaska_cities_d.astype(np.int64).describe()

# average ALASKA dealyed flights
alaska_cities_delayed = alaska_cities_d.mean()
alaska_cities_delayed

100.2

In [73]:
# AM WEST ON TIME
df.loc[3]
# AM WEST cities delayed
amwest_cities_d = df.iloc[2,2:]
amwest_cities_d

# change type from object to int to performe math calculations 

amwest_cities_d.astype(np.int64)
# run the describe method, shows math operations: count, mean, std, min, 25%, 50%, 75%, max

amwest_cities_d.astype(np.int64).describe()

# average AM WEST on time flight performance
amwest_cities_delayed = amwest_cities_d.mean()
amwest_cities_delayed

1287.6

In [76]:
# compare the ontime flights for both airlines and put in a new dataframe
df2 = pd.DataFrame({
    'Alaska Delayed flights Average': [alaska_cities_delayed],
    'AM WEST Delayed flights Average': [amwest_cities_delayed]
})
df2

   Alaska Delayed flights Average  AM WEST Delayed flights Average
0                           100.2                           1287.6

In [83]:
# Combine df1 and df2 horizontally, excluding NaN values
result = df1.join(df2, how='inner')

# Print the result
print(result)

   ALASKA average on time flights  AM WEST average on time flights  \
0                           654.8                           1287.6

   Alaska Delayed flights Average  AM WEST Delayed flights Average
0                           100.2                           1287.6

In [85]:
# Display the combined DataFrame as a formatted table
display(result)

,ALASKA average on time flights,AM WEST average on time flights,Alaska Delayed flights Average,AM WEST Delayed flights Average
0,654.8,1287.6,100.2,1287.6